[.labslide]
== Lab 1

=== Which directors also acted in their movie?

=== Query

//hide
include::http:////movies.adoc

[source,cypher]
----
//a comment
MATCH (d)-[:DIRECTED]->(m)<-[:ACTED_IN]-(d)
RETURN d.name, m.title;
----

=== Result

//table